vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G43x_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.7.37" 
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.37/schema/PACK.xsd">
    <vendor>NSING</vendor>
    <url>https://www.nsing.com.sg/public/uploads/armpacks/</url>
    <name>N32G43x_DFP</name>
    <description>Nsing N32G43x Series Device Support, Drivers and Examples</description>

    <releases>
		<release date="2024-08-14" version="0.9.7">		    
            First release of N32G401_DFP
        </release>
    </releases>

    <keywords>
        <keyword>NSING</keyword>
        <keyword>Device Support</keyword>
        <keyword>N32G43x</keyword>
		<keyword>N32</keyword>
    </keywords>

    <devices>
        <family Dfamily="N32G43x Series" Dvendor="NSING:185">
			<processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="0" Dendian="Little-endian"/>
			<description>
The N32G432 series utilizes a 32-bit ARM Cortex-M4F core with operating frequency up to 108MHz. 

- Up to 128KB embedded encrypted Flash memory.
- 32KB SRAM, 52x PIO(MAX)
- 1x 12bit 5Msps ADC, 1x 12bit DAC, 28x PWM(MAX)
- 5x USART,1x LPUART, 2x I2C, 2x SPI, 1x DMA,  1x OPA and 2x Beeper	
- RTC, 8x Timer, 30+1 GPOs, USB2.0, 1x CAN, 1x DMA.
- Hardware Cryptographics Engine.
			</description>
			<subFamily DsubFamily="N32G432">		  
				<processor Dclock="108000000"/>		   
				<compile header="firmware/CMSIS/device/n32g43x.h" define="N32G43X USE_STDPERIPH_DRIVER"/>
				<feature type="XTAL"     n="4000000"     m="32000000" name="External Crystal Oscillator"/>		   
				<feature type="VCC"      n="1.80"        m="3.60"/>		
				<feature type="Temp"     n="-40"        m="105"/>	
				<feature type="RTC"      n="1"/>		   
				<!-- *************************  Device 'N32G401C8L7'  ***************************** -->
				<device Dname="N32G432K8"> 
					<description>
- Package:LQFP32
- LPUART: 1x		
					</description>					
						<feature type="Memory"   n="64" 	name="64KB Flash"/>	
						<feature type="Memory"   n="24" 	name="24KB SRAM"/>	
						<feature type="IOs"      n="26"     name="Input and Output Ports"/>
						<feature type="Timer"    n="9"/>
						<feature type="PWM"      n="14"/>				
						<feature type="ADC"      n="10"    	m="12"  name="10-ch 12bit ADC"/>	
						<feature type="DAC"      n="1"/>
						<feature type="USART"    n="2"/>
						<feature type="UART"     n="2"/>	
						<feature type="SPI"      n="2"/>	
						<feature type="I2C"      n="2"/>	
						<feature type="USBD"     n="1"/>	
						<feature type="CAN"      n="1"/>				
						<feature type="DMA"      n="8"/>			
						
						<memory id="IRAM1"   start="0x20000000" size="0x6000" default="1" init="0"/>
						<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
						<algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x10000" default="1"/>
						<debug svd="svd/N32G432.svd"/>
					</device>	
				<!-- *************************  Device 'N32G432KB'  ***************************** -->		  
					<device Dname="N32G432KB"> 
						<description>
- Package:LQFP32
- LPUART: 1x		
						</description>					
						<feature type="Memory"   n="128" 	name="128KB Flash"/>	
						<feature type="Memory"   n="32" 	name="32KB SRAM"/>	
						<feature type="IOs"      n="26"     name="Input and Output Ports"/>
						<feature type="Timer"    n="9"/>
						<feature type="PWM"      n="14"/>				
						<feature type="ADC"      n="10"    	m="12"  name="10-ch 12bit ADC"/>	
						<feature type="DAC"      n="1"/>
						<feature type="USART"    n="2"/>
						<feature type="UART"     n="2"/>	
						<feature type="SPI"      n="2"/>	
						<feature type="I2C"      n="2"/>
						<feature type="USBD"     n="1"/>	
						<feature type="CAN"      n="1"/>				
						<feature type="DMA"      n="8"/>			
							
						<memory id="IRAM1"   start="0x20000000" size="0x8000" default="1" init="0"/>
						<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
						<algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x20000" default="1"/>
						<debug svd="svd/N32G432.svd"/>
					 </device>
		  <!-- *************************  Device 'N32G432C8'  ***************************** -->		  
		  <device Dname="N32G432C8"> 
			<description>
- Package:LQFP48
- LPUART: 1x		
			</description>					
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="24" 	name="24KB SRAM"/>	
			<feature type="IOs"      n="38"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="10"    	m="12"  name="10-ch 12bit ADC"/>	
			<feature type="DAC"      n="1"/>
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>		
			<feature type="CAN"      n="1"/>
 			<feature type="DMA"      n="8"/>	
			
			<memory id="IRAM1"   start="0x20000000" size="0x6000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G432.svd"/>
          </device>
		  <!-- *************************  Device 'N32G432CB'  ***************************** -->		  
		  <device Dname="N32G432CB"> 
			<description>
- Package:LQFP48
- LPUART: 1x		
			</description>					
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="32" 	name="32KB SRAM"/>	
			<feature type="IOs"      n="38"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="10"    	m="12"  name="10-ch 12bit ADC"/>	
			<feature type="DAC"      n="1"/>
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="1"/>
			<feature type="DMA"      n="8"/>	
			
			<memory id="IRAM1"   start="0x20000000" size="0x8000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32G432.svd"/>
          </device>
		  <!-- *************************  Device 'N32G432R8'  ***************************** -->		  
		  <device Dname="N32G432R8"> 
			<description>
- Package:LQFP64
- LPUART: 1x		
			</description>					
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="24" 	name="24KB SRAM"/>	
			<feature type="IOs"      n="52"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="28"/>				
			<feature type="ADC"      n="16"    	m="12"  name="16-ch 12bit ADC"/>	
			<feature type="DAC"      n="1"/>
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>	
			<feature type="CAN"      n="1"/>
 			<feature type="DMA"      n="8"/>	
			
			<memory id="IRAM1"   start="0x20000000" size="0x6000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G432.svd"/>
          </device>
