vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G43x_DFP.pdsc
		  <!-- *************************  Device 'N32G432RB'  ***************************** -->		  
		  <device Dname="N32G432RB"> 
			<description>
- Package:LQFP64
- LPUART: 1x		
			</description>					
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="32" 	name="32KB SRAM"/>	
			<feature type="IOs"      n="52"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="28"/>				
			<feature type="ADC"      n="16"    	m="12"  name="16-ch 12bit ADC"/>	
			<feature type="DAC"      n="1"/>
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>		
			<feature type="CAN"      n="1"/>
			<feature type="DMA"      n="8"/>	
			
			<memory id="IRAM1"   start="0x20000000" size="0x8000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32G432.svd"/>
          </device> 
		  
			</subFamily>
			<subFamily DsubFamily="N32G435">
				<description>
The N32G435 series utilizes a 32-bit ARM Cortex-M4F core with operating frequency up to 108MHz. 

- Up to 128KB embedded encrypted Flash memory.
- 32KB SRAM, 52x GPIO(MAX)
- 1x 12bit 5Msps ADC, 1x 12bit DAC, 1x COMP, 2x OPAMP, TSC, 
- 5x USART,1x LPUART, 2x I2C, 2x SPI, 3x COMP, 1x DMA, 22x PWM, 1x OPA 
- RTC, 8x Timer, 30+1 GPOs, USB2.0, 1x CAN, 1x DMA, 1x CAN
- Hardware Cryptographics Engine.
				</description>		  
				<!--processor Dclock="108000000"/ -->	   
				<compile header="firmware/CMSIS/device/n32g43x.h" define="N32G43X N32G435 USE_STDPERIPH_DRIVER"/>
				<feature type="XTAL"     n="4000000"     m="32000000" name="External Crystal Oscillator"/>		   
				<feature type="VCC"      n="1.80"        m="3.60"/>		
				<feature type="Temp"     n="-40"        m="105"/>	
				<feature type="RTC"      n="1"/>		   
				<!-- *************************  Device 'N32G435G8'  ***************************** -->
				<device Dname="N32G435G8"> 
				<description>
- Package:LQFP48
- LPUART: 1x	
- OPAMP: 2x	
- COMP: 2x
- TSC: 1x
				</description>					
				<feature type="Memory"   n="64" 	name="64KB Flash"/>	
				<feature type="Memory"   n="16" 	name="16KB SRAM"/>	
				<feature type="IOs"      n="24"     name="Input and Output Ports"/>
				<feature type="Timer"    n="9"/>
				<feature type="PWM"      n="14"/>				
				<feature type="ADC"      n="10"    	m="12"  name="10-ch 12bit ADC"/>	
				<feature type="DAC"      n="1"/>
				<feature type="USART"    n="2"/>
				<feature type="UART"     n="2"/>	
				<feature type="SPI"      n="1"/>	
				<feature type="I2C"      n="2"/>	
				<feature type="USBD"     n="0"/>	
				<feature type="CAN"      n="0"/>				
				<feature type="DMA"      n="8"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G435.svd"/>
          </device>			
		  <!-- *************************  Device 'N32G435GB'  ***************************** -->
		  <device Dname="N32G435GB"> 
			<description>
- Package:LQFP48
- LPUART: 1x	
- OPAMP: 2x	
- COMP: 2x
- TSC: 8x
			</description>					
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="32" 	name="32KB SRAM"/>	
			<feature type="IOs"      n="24"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="14"/>				
			<feature type="ADC"      n="10"    	m="12"  name="10-ch 12bit ADC"/>	
			<feature type="DAC"      n="1"/>
			<feature type="USART"    n="2"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="1"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="USBD"     n="0"/>	
			<feature type="CAN"      n="0"/>				
			<feature type="DMA"      n="8"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x8000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32G435.svd"/>
          </device>	
		  <!-- *************************  Device 'N32G435K8'  ***************************** -->
		  <device Dname="N32G435K8"> 
			<description>
- Package:LQFP48
- LPUART: 1x	
- OPAMP: 2x	
- COMP: 2x
- TSC: 12x
			</description>					
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="16" 	name="16KB SRAM"/>	
			<feature type="IOs"      n="24"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="14"/>				
			<feature type="ADC"      n="10"    	m="12"  name="10-ch 12bit ADC"/>	
			<feature type="DAC"      n="1"/>
			<feature type="USART"    n="2"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="1"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="USBD"     n="1"/>	
			<feature type="CAN"      n="1"/>				
			<feature type="DMA"      n="8"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G435.svd"/>
          </device>			  
		  <!-- *************************  Device 'N32G435KB'  ***************************** -->
		  <device Dname="N32G435KB"> 
			<description>
- Package:LQFP48
- LPUART: 1x	
- OPAMP: 2x	
- COMP: 2x
- TSC: 12x
			</description>					
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="32" 	name="32KB SRAM"/>	
			<feature type="IOs"      n="24"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="14"/>				
			<feature type="ADC"      n="10"    	m="12"  name="10-ch 12bit ADC"/>	
			<feature type="DAC"      n="1"/>
			<feature type="USART"    n="2"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="USBD"     n="1"/>	
			<feature type="CAN"      n="1"/>				
			<feature type="DMA"      n="8"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x8000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32G435.svd"/>
          </device>		
		  <!-- *************************  Device 'N32G435T8'  ***************************** -->
		  <device Dname="N32G435T8"> 
			<description>
- Package:LQFP36
- LPUART: 1x	
- OPAMP: 2x	
- COMP: 2x
- TSC: 16x
			</description>					
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="24" 	name="24KB SRAM"/>	
			<feature type="IOs"      n="27"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="10"    	m="12"  name="10-ch 12bit ADC"/>	
			<feature type="DAC"      n="1"/>
			<feature type="USART"    n="2"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="USBD"     n="1"/>	
			<feature type="CAN"      n="1"/>				
			<feature type="DMA"      n="8"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x6000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G435.svd"/>
          </device>
		  <!-- *************************  Device 'N32G435C8'  ***************************** -->
		  <device Dname="N32G435C8"> 
			<description>
- Package:LQFP48
- LPUART: 1x	
- OPAMP: 2x	
- COMP: 2x
- TSC: 16x
			</description>					
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="24" 	name="24KB SRAM"/>	
			<feature type="IOs"      n="38"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="10"    	m="12"  name="10-ch 12bit ADC"/>	
			<feature type="DAC"      n="1"/>
			<feature type="USART"    n="2"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="USBD"     n="1"/>	
			<feature type="CAN"      n="1"/>				
			<feature type="DMA"      n="8"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x6000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G435.svd"/>
          </device>		  
		  <!-- *************************  Device 'N32G435CB'  ***************************** -->
		  <device Dname="N32G435CB"> 
			<description>
- Package:LQFP48
- LPUART: 1x	
- OPAMP: 2x	
- COMP: 2x
- TSC: 16x
			</description>					
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="32" 	name="32KB SRAM"/>	
			<feature type="IOs"      n="38"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="10"    	m="12"  name="10-ch 12bit ADC"/>	
			<feature type="DAC"      n="1"/>
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="USBD"     n="1"/>	
			<feature type="CAN"      n="1"/>				
			<feature type="DMA"      n="8"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x8000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32G435.svd"/>
          </device>			  
		  <!-- *************************  Device 'N32G435R8'  ***************************** -->
		  <device Dname="N32G435R8"> 
			<description>
- Package:LQFP64
- LPUART: 1x	
- OPAMP: 2x	
- COMP: 2x
- TSC: 20x
			</description>					
		    <feature type="Memory"   n="64" 	name="64KB Flash"/>	
		    <feature type="Memory"   n="24" 	name="24KB SRAM"/>	
			<feature type="IOs"      n="52"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="16"    	m="12"  name="16-ch 12bit ADC"/>	
			<feature type="DAC"      n="1"/>
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="USBD"     n="1"/>	
			<feature type="CAN"      n="1"/>				
			<feature type="DMA"      n="8"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x6000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G435.svd"/>
          </device>	
		  <!-- *************************  Device 'N32G435RB'  ***************************** -->
		  <device Dname="N32G435RB"> 
			<description>
- Package:LQFP64
- LPUART: 1x	
- OPAMP: 2x	
- COMP: 2x
- TSC: 20x
			</description>					
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="32" 	name="32KB SRAM"/>	
			<feature type="IOs"      n="52"     name="Input and Output Ports"/>
			<feature type="Timer"    n="9"/>
			<feature type="PWM"      n="28"/>				
			<feature type="ADC"      n="16"    	m="12"  name="16-ch 12bit ADC"/>	
			<feature type="DAC"      n="1"/>
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="2"/>	
		    <feature type="SPI"      n="2"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="USBD"     n="1"/>	
			<feature type="CAN"      n="1"/>				
			<feature type="DMA"      n="8"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x8000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32G43x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32G435.svd"/>
          </device>	
		</subFamily>
		  
        </family>
    </devices> 

    <conditions>   
		
		<!-- Device Conditions -->
		<condition id="N32G43x">
		  <description>NSING N32G43x Devices</description> 
		  <require Dvendor="NSING:185" Dname="N32*"/> 
		</condition>
		
		<!-- Device + CMSIS Conditions -->
        <condition id="N32G43x CMSIS">            
		    <description>NSING N32G43x Device and the ARM compiler</description>
		    <require condition="N32G43x"/>
		    <require Tcompiler="ARMCC"/>
        </condition>

