vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G43x_DFP.pdsc
        <component Cclass="Device" Cgroup="N32G43x_StdPeripherals" Csub="FLASH" Cversion="1.0.0" condition="N32G43x STDPERIPHERALS RCC">
            <description>Embedded Flash memory (FLASH) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FLASH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_flash.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_flash.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G43x_StdPeripherals" Csub="GPIO" Cversion="1.0.0" condition="N32G43x STDPERIPHERALS RCC">
            <description>General-purpose I/O (GPIO) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_GPIO
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_gpio.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_gpio.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G43x_StdPeripherals" Csub="I2C" Cversion="1.0.0" condition="N32G43x STDPERIPHERALS RCC">
            <description>Inter-integrated circuit (I2C) interface driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_I2C
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_i2c.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_i2c.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G43x_StdPeripherals" Csub="IWDG" Cversion="1.0.0" condition="N32G43x STDPERIPHERALS RCC">
            <description>Independent watchdog (IWDG) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_IWDG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_iwdg.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_iwdg.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G43x_StdPeripherals" Csub="LPTIM" Cversion="1.0.0" condition="N32G43x STDPERIPHERALS RCC">
            <description>Low Power Timers (LPTIM) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_LPTIM
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_lptim.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_lptim.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G43x_StdPeripherals" Csub="LPUART" Cversion="1.0.0" condition="N32G43x STDPERIPHERALS RCC">
            <description>Low Power Universal asynchronous receiver transmitter (LPUART) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_LPUART
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_lpuart.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_lpuart.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G43x_StdPeripherals" Csub="OPAMP" Cversion="1.0.0" condition="N32G43x STDPERIPHERALS RCC">
            <description>Operational amplifier (OPAMP) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_OPAMP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_opamp.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_opamp.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G43x_StdPeripherals" Csub="PWR" Cversion="1.0.0" condition="N32G43x STDPERIPHERALS RCC">
            <description>Power controller (PWR) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_PWR
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_pwr.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_pwr.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G43x_StdPeripherals" Csub="RCC" Cversion="1.0.0" condition="N32G43x STDPERIPHERALS RCC">
            <description>Reset and clock control (RCC) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RCC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_rcc.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_rcc.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G43x_StdPeripherals" Csub="RTC" Cversion="1.0.0" condition="N32G43x STDPERIPHERALS RCC">
            <description>Real-time clock (RTC) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RTC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_rtc.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_rtc.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G43x_StdPeripherals" Csub="SPI" Cversion="1.0.0" condition="N32G43x STDPERIPHERALS RCC">
            <description>Serial peripheral interface (SPI) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SPI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_spi.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_spi.c"/>
            </files>
        </component>
		
