vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G43x_DFP.pdsc
        <component Cclass="Device" Cgroup="N32G43x_StdPeripherals" Csub="TIMER" Cversion="1.0.0" condition="N32G43x STDPERIPHERALS RCC">
            <description>Timers (TIMER) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_TIM
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_tim.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_tim.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G43x_StdPeripherals" Csub="USART" Cversion="1.0.0" condition="N32G43x STDPERIPHERALS RCC">
            <description>Universal asynchronous receiver transmitter (USART) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USART
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_usart.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_usart.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G43x_StdPeripherals" Csub="WWDG" Cversion="1.0.0" condition="N32G43x STDPERIPHERALS RCC">
            <description>Window watchdog (WWDG) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_WWDG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_std_periph_driver/inc/n32g43x_wwdg.h"/>
                <file category="source" name="firmware/n32g43x_std_periph_driver/src/n32g43x_wwdg.c"/>
            </files>
        </component>		

        <component Cclass="Device" Cgroup="N32G43x_StdPeripherals" Csub="USBDEV" Cversion="1.0.0" condition="N32G43x STDPERIPHERALS RCC">
            <description>USB device (USBDEV) driver for N32G43x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USBDEV
            </RTE_Components_h>
            <files>
                <file category="include" name="firmware/n32g43x_usbfs_driver/inc/"/>
                <file category="header" name="firmware/n32g43x_usbfs_driver/inc/usb_core.h"/>
                <file category="header" name="firmware/n32g43x_usbfs_driver/inc/usb_def.h"/>
                <file category="header" name="firmware/n32g43x_usbfs_driver/inc/usb_init.h"/>
                <file category="header" name="firmware/n32g43x_usbfs_driver/inc/usb_int.h"/>
                <file category="header" name="firmware/n32g43x_usbfs_driver/inc/usb_lib.h"/>
                <file category="header" name="firmware/n32g43x_usbfs_driver/inc/usb_mem.h"/>
                <file category="header" name="firmware/n32g43x_usbfs_driver/inc/usb_regs.h"/>
                <file category="header" name="firmware/n32g43x_usbfs_driver/inc/usb_sil.h"/>
                <file category="header" name="firmware/n32g43x_usbfs_driver/inc/usb_type.h"/>
                <file category="source" name="firmware/n32g43x_usbfs_driver/src/usb_core.c"/>
                <file category="source" name="firmware/n32g43x_usbfs_driver/src/usb_init.c"/>
                <file category="source" name="firmware/n32g43x_usbfs_driver/src/usb_int.c"/>
                <file category="source" name="firmware/n32g43x_usbfs_driver/src/usb_mem.c"/>
                <file category="source" name="firmware/n32g43x_usbfs_driver/src/usb_regs.c"/>
                <file category="source" name="firmware/n32g43x_usbfs_driver/src/usb_sil.c"/>
            </files>
        </component>

       <component Cclass="Device" Cgroup="Algorithm Libs" Csub="Common" Cversion="1.0.0" condition="N32G43x CMSIS">
            <description>algo common driver for N32G43x</description>	   
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_COMMON
            </RTE_Components_h>
            <files>
                <file category="include" name="firmware/n32g43x_algo_lib/inc/"/>
                <file category="header" name="firmware/n32g43x_algo_lib/inc/n32g43x_algo_common.h"/>
                <file category="source" name="firmware/n32g43x_algo_lib/lib/n32g43x_algo_common.lib"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="AES" Cversion="1.0.0" condition="N32G43x Algorithm Common">
            <description>AES driver for N32G43x</description>		
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_AES
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_algo_lib/inc/n32g43x_aes.h"/>
                <file category="source" name="firmware/n32g43x_algo_lib/lib/n32g43x_aes.lib"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="DES" Cversion="1.0.0" condition="N32G43x Algorithm Common">
            <description>DES driver for N32G43x</description>		
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_DES
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_algo_lib/inc/n32g43x_des.h"/>
                <file category="source" name="firmware/n32g43x_algo_lib/lib/n32g43x_des.lib"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="HASH" Cversion="1.0.0" condition="N32G43x Algorithm Common">
            <description>HASH driver for N32G43x</description>		
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_HASH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_algo_lib/inc/n32g43x_hash.h"/>
                <file category="source" name="firmware/n32g43x_algo_lib/lib/n32g43x_hash.lib"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="RNG" Cversion="1.0.0" condition="N32G43x Algorithm Common">
            <description>GNG driver for N32G43x</description>		
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_RNG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g43x_algo_lib/inc/n32g43x_rng.h"/>
                <file category="source" name="firmware/n32g43x_algo_lib/lib/n32g43x_rng.lib"/>
            </files>
        </component> 

		
    </components>
</package>
